Belajar Data Types dan Missing Value

In [1]:
# mempersiapkan module yang diperlukan
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

Matplotlib created a temporary cache directory at C:\Users\mmuiz\AppData\Local\Temp\matplotlib-gsf9p2p4 because the default path (C:\Users\mmuiz\.matplotlib) is not a writable directory; it is highly recommended to set the MPLCONFIGDIR environment variable to a writable directory, in particular to speed up the import of Matplotlib and to better support multiprocessing.
Matplotlib is building the font cache; this may take a moment.

In [2]:
# mempersiapkan dataset yang diperlukan
Dataset = pd.read_csv('C:\Latihan\Latihan\Python\Sample Data\olympics2024.csv')
Dataset

    Rank        Country Country Code  Gold  Silver  Bronze  Total
0      1  United States           US    40      44      42    126
1      2          China          CHN    40      27      24     91
2      3          Japan          JPN    20      12      13     45
3      4      Australia          AUS    18      19      16     53
4      5         France          FRA    16      26      22     64
..   ...            ...          ...   ...     ...     ...    ...
86    84           Peru          PER     0       0       1      1
87    84          Qatar          QAT     0       0       1      1
88    84      Singapore          SIN     0       0       1      1
89    84       Slovakia          SVK     0       0       1      1
90    84         Zambia          ZAM     0       0       1      1

[91 rows x 7 columns]

Data Type

Tipe data untuk kolom dalam DataFrame atau Seri dikenal sebagai tipe d.

Anda dapat menggunakan properti dtype untuk mengambil tipe kolom tertentu. Misalnya, kita bisa mendapatkan dtype kolom Country di ulasan DataFrame:

In [5]:
# contoh 1

Dataset.Country.dtypes
# sintaks ini digunakan dalam bahasa pemrograman Python dengan pustaka pandas untuk mengetahui tipe data 
# (data type) dari kolom Country dalam DataFrame Dataset.

dtype('O')

Alternatifnya, properti dtypes mengembalikan dtype setiap kolom di DataFrame:

In [4]:
# contoh 2
Dataset.dtypes

Rank             int64
Country         object
Country Code    object
Gold             int64
Silver           int64
Bronze           int64
Total            int64
dtype: object

Tipe data memberi tahu kita sesuatu tentang cara panda menyimpan data secara internal. float64 artinya menggunakan bilangan floating point 64-bit; int64 berarti bilangan bulat berukuran sama, dan seterusnya.

Satu kekhasan yang perlu diingat (dan ditampilkan dengan sangat jelas di sini) adalah bahwa kolom yang seluruhnya terdiri dari string tidak mendapatkan tipenya sendiri; mereka malah diberi tipe objek.

Dimungkinkan untuk mengonversi kolom dari satu tipe ke tipe lain di mana pun konversi tersebut masuk akal dengan menggunakan fungsi astype(). Misalnya, kita dapat mengubah kolom poin dari tipe data int64 yang ada menjadi tipe data float64:

In [6]:
# contoh 3

Dataset.Rank.astype('float64')

# sintaks ini digunakan untuk mengonversi tipe data dari kolom Rank dalam DataFrame Dataset 
# menjadi tipe float64.

0      1.0
1      2.0
2      3.0
3      4.0
4      5.0
      ...
86    84.0
87    84.0
88    84.0
89    84.0
90    84.0
Name: Rank, Length: 91, dtype: float64

Indeks DataFrame atau Seri juga memiliki tipe d sendiri:

In [7]:
# contoh 4

Dataset.index.dtype

dtype('int64')

Pandas juga mendukung tipe data yang lebih eksotik, seperti data kategorikal dan data deret waktu. Karena tipe data ini lebih jarang digunakan, kami akan menghilangkannya hingga bagian selanjutnya dari tutorial ini.

2. Missing Data

Entri nilai yang hilang diberi nilai NaN, singkatan dari "Not a Number". Untuk alasan teknis, nilai NaN ini selalu bertipe d float64.

Pandas menyediakan beberapa metode khusus untuk data yang hilang. Untuk memilih entri NaN, Anda dapat menggunakan pd.isnull() (atau pendampingnya pd.notnull()). Ini dimaksudkan untuk digunakan sebagai berikut:

In [8]:
# contoh 5

Dataset[pd.isnull(Dataset.Country)]

# sintaks ini digunakan untuk menyaring baris-baris dalam DataFrame Dataset 
# di mana kolom Country memiliki nilai null atau NaN (Not a Number).

Empty DataFrame
Columns: [Rank, Country, Country Code, Gold, Silver, Bronze, Total]
Index: []

Mengganti nilai yang hilang adalah operasi yang umum. Pandas menyediakan metode yang sangat berguna untuk masalah ini: fillna(). fillna() memberikan beberapa strategi berbeda untuk memitigasi data tersebut. Misalnya, kita cukup mengganti setiap NaN dengan "Tidak Diketahui":

In [9]:
# contoh 6

Dataset.Rank.fillna('unknown')

# sintaks ini digunakan untuk menggantikan nilai NaN atau null 
# dalam kolom Rank dari DataFrame Dataset dengan nilai 'unknown'.

0      1
1      2
2      3
3      4
4      5
      ..
86    84
87    84
88    84
89    84
90    84
Name: Rank, Length: 91, dtype: int64